---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FormFailures.FormCreationInvalidGeomCombination
source: html/7328a16e-e53f-58e9-ffb3-45ceabc45703.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FormFailures.FormCreationInvalidGeomCombination Property

Cannot remake form that is currently cut or joined to other geometry. Please uncut or unjoin first.

## Syntax (C#)
```csharp
public static FailureDefinitionId FormCreationInvalidGeomCombination { get; }
```